var quotes_1 = [
    // Греция
      {
        "epoch": "Греция, 5в до нэ",
        "phrase": "Мировые пожары – это мировые суды",
        "signature": "Гераклит"
      },
      
      {
        "epoch": "Греция, 4в до нэ",
        "phrase": "С сердцем бороться тяжело",
        "signature": "Демокрит"
      },
      
      {
        "epoch": "Греция, 4в до нэ",
        "phrase": "Человек – это политическое животное",
        "signature": "Аристотель"
      },
      
      {
        "epoch": "Греция, 4в до нэ",
        "phrase": "Искусство – это копия копии",
        "signature": "Платон"
      },
      
      {
        "epoch": "Греция, 4в до нэ",
        "phrase": "В космосе есть два мира: и идей и мир вещей",
        "signature": "Платон"
      },
      
      {
        "epoch": "Греция, 4в до нэ",
        "phrase": "Бог – это скульптор",
        "signature": "Платон"
      },
      
      {
        "epoch": "Греция, 4в до нэ",
        "phrase": "Действительность раньше возможности",
        "signature": "Аристотель"
      },
      
      {
        "epoch": "Греция, 4в до нэ",
        "phrase": "Бог - перводвигатель",
        "signature": "Аристотель"
      },
      ////////////////////////////////
      // Элинизм
      ///////////////////////////////
      {
        "epoch": "Общий элинизм, 4в до нэ",
        "phrase": "Проживи незаметно",
        "signature": "Эпикур"
      },
      
      {
        "epoch": "Киники, 4в до нэ",
        "phrase": "Богатство не относится к числу необходимых вещей",
        "signature": "Антисфен"
      },
      
      {
        "epoch": "Киники, 4в до нэ",
        "phrase": "Мои мысли никому не подвластны",
        "signature": "Антисфен"
      },
      
      {
        "epoch": "Киники, 4в до нэ",
        "phrase": "Нужно жить никого не боясь и ничего не стыдясь",
        "signature": "Антисфен"
      },
      
      {
        "epoch": "Киники, 4в до нэ",
        "phrase": "Философия - умение беседовать самим с собой",
        "signature": "Антисфен"
      },
      
      {
        "epoch": "Киники, 4в до нэ",
        "phrase": "Я гражданин мира",
        "signature": "Антисфен"
      },
      
      {
        "epoch": "Школа Эпикура, ???",
        "phrase": "Школе кинеков не хватило чувства брезгливости",
        "signature": "Цицерон"
      },
      
      {
        "epoch": "Киники, 4в до нэ",
        "phrase": "Мудрец не живет по законам государства",
        "signature": "Антисфен"
      },
      
      {
        "epoch": "Киники, 4в до нэ",
        "phrase": "В молодости жениться рано, в старости – поздно, жениться не нужно никогда",
        "signature": "Антисфен"
      },
      
      {
        "epoch": "Киники, 4в до нэ",
        "phrase": "Он единственный смог убедить смертных, что жизнь сама по себе прекрасна",
        "signature": "Антисфен"
      },
      
      {
        "epoch": "Школа Эпикура, 4в до нэ",
        "phrase": "Боги – почти тело, почти душа",
        "signature": "Эпикур"
      },
      
      {
        "epoch": "Школа Эпикура, 4в до нэ",
        "phrase": "Корона атараксии превосходит корону империи",
        "signature": "Эпикур"
      },
      
      {
        "epoch": "Школа Эпикура, 4в до нэ",
        "phrase": "Мудрец будет счастлив и на дыбе",
        "signature": "Эпикур"
      },
      
      {
        "epoch": "Школа Эпикура, 4в до нэ",
        "phrase": "Люди – это атомы, а атомы движутся случайно»",
        "signature": "Эпикур"
      },
      
      {
        "epoch": "Древняя стоя, 3в до нэ",
        "phrase": "Выполняй долг, даже если никто не видит",
        "signature": "Хрисипп"
      },
      
      {
        "epoch": "Древняя стоя, 3в до нэ",
        "phrase": "Мудрец будет есть человеческое мясо",
        "signature": "Хрисипп"
      },
      
      {
        "epoch": "Древняя стоя, 5в до нэ",
        "phrase": "Печаль – это сжатие души",
        "signature": "Зенон"
      },
      
      {
        "epoch": "Поздняя стоя, 1в",
        "phrase": "Мы не можем изменить строя вещей",
        "signature": "Сенека"
      },
      
      {
        "epoch": "Поздняя стоя, 1в",
        "phrase": "Когда сопротивляешься судьбе - она тебя тащит, ???",
        "signature": "Сенека"
      },
      
      {
        "epoch": "Поздняя стоя, 1в",
        "phrase": "Месть требует слишком много времени",
        "signature": "Сенека"
      },
      
      {
        "epoch": "Поздняя стоя, 2в",
        "phrase": "Все мимолетно",
        "signature": "Марк Аврелий"
      },
      
      {
        "epoch": "Неоплатоники, 3в",
        "phrase": "Жизнь – это бег одного к Одному",
        "signature": "Плотин"
      },
      
      {
        "epoch": "Неоплатоники, 3в",
        "phrase": "Сбрось с себя все",
        "signature": "Плотин"
      },
      
    ///////////////////////////////////////// 
    // Восток
    ////////////////////////////////////////
      {
        "epoch": "Общий Восток, 5в до нэ",
        "phrase": "Не надо ничего создавать, надо только передавать",
        "signature": "Конфуций"
      },
          
      {
        "epoch": "Общий Восток, 5в до нэ",
        "phrase": "Даже волос не пройдет между моралью и образованием",
        "signature": "Конфуций"
      },
          
      {
        "epoch": "Общий Восток, 5в до нэ",
        "phrase": "Я видел как он шел, но не разу не видел, чтобы он остановились",
        "signature": "Конфуций"
      },
          
      {
        "epoch": "Общий Восток, 5в до нэ",
        "phrase": "Путь делает человека великим",
        "signature": "Конфуций"
      },
          
      {
        "epoch": "Общий Восток, ???",
        "phrase": "Человек - это растущее дерево",
        "signature": "Мэн Цзы"
      },
              
      {
        "epoch": "Конфуцианство, 5в до нэ",
        "phrase": "Без Ли рушится государство",
        "signature": "Конфуций"
      },
      
      {
        "epoch": "Конфуцианство, 5в до нэ",
        "phrase": "Отец должен быть отцом, сын – сыном, а государь - государем",
        "signature": "Конфуций"
      },
        
      {
        "epoch": "Конфуцианство, 5в до нэ",
        "phrase": "Человек – это жертвенный сосуд",
        "signature": "Конфуций"
      },
        
      {
        "epoch": "Конфуцианство, 5в до нэ",
        "phrase": "Не выходя со двора, знаешь поднебесную",
        "signature": "Конфуций"
      },
        
      {
        "epoch": "Конфуцианство, 5в до нэ",
        "phrase": "Управление начинается с исправления имен",
        "signature": "Конфуций"
      },
        
      {
        "epoch": "Конфуцианство, 5в до нэ",
        "phrase": "Как можно управлять другими, если ты не управляешь собой?",
        "signature": "Конфуций"
      },
        
      {
        "epoch": "Даосизм, 6в до нэ",
        "phrase": "Дао не владеет даже собой",
        "signature": "Лао Цзы"
      },
        
      {
        "epoch": "Даосизм, 4в до нэ",
        "phrase": "Вещи – это хор поющий без слов",
        "signature": "Чжуан Цзы"
      },
          
      {
        "epoch": "Даосизм, 6в до нэ",
        "phrase": "Правитель должен быть похож на Дао",
        "signature": "Лао Цзы"
      },
          
      {
        "epoch": "Даосизм, 6в до нэ",
        "phrase": "Не делай ничего и все будет сделано",
        "signature": "Лао Цзы"
      },
          
      {
        "epoch": "Даосизм, 6в до нэ",
        "phrase": "Я – сердце самого глупого",
        "signature": "Лао Цзы"
      },
          
      {
        "epoch": "Даосизм, 6в до нэ",
        "phrase": "Дао – это необработанная глыба",
        "signature": "Лао Цзы"
      },
          
      {
        "epoch": "Даосизм, 6в до нэ",
        "phrase": "Уйти далеко – значит вернуться",
        "signature": "Лао Цзы"
      },
          
      {
        "epoch": "Даосизм, 6в до нэ",
        "phrase": "Быть согнутым и оставаться прямым",
        "signature": "Лао Цзы"
      },
          
      {
        "epoch": "Даосизм, 4в до нэ",
        "phrase": "Никто не жил дольше умершего младенца",
        "signature": "Чжуан Цзы"
      },
           
      {
        "epoch": "Даосизм, 4в до нэ",
        "phrase": "Всё хорошо для чего-то",
        "signature": "Чжуан Цзы"
      },
           
      {
        "epoch": "Даосизм, 4в до нэ",
        "phrase": "Возможное – возможно и невозможное - возможно",
        "signature": "Чжуан Цзы"
      },
           
      {
        "epoch": "Индийский буддизм, 6в до нэ",
        "phrase": "Нечто сначала существует, а потом возникает",
        "signature": "Будда"
      },
            
      {
        "epoch": "Индийский буддизм, 6в до нэ",
        "phrase": "Много религий – отрицание морали",
        "signature": "Будда"
      },
        

      {
        "epoch": "Индийский буддизм, 6в до нэ",
        "phrase": "Жрецы не спасают человека",
        "signature": "Будда"
      },
             
      {
        "epoch": "Индийский буддизм, 6в до нэ",
        "phrase": "Все что существует недостаточно",
        "signature": "Будда"
      },
        
            
      {
        "epoch": "Индийский буддизм, 6в до нэ",
        "phrase": "Рождение – уже есть страдания",
        "signature": "Будда"
      },
        
            
      {
        "epoch": "Индийский буддизм, 6в до нэ",
        "phrase": "Ненависть прекращается от любви",
        "signature": "Будда"
      },
        
      {
        "epoch": "Чань-буддизм, 6в до нэ",
        "phrase": "Сделать шаг над вершиной бамбука»",
        "signature": "Будда"
      },
        
      {
        "epoch": "Чань-буддизм, 6в до нэ",
        "phrase": "Кушать целый день и не дотронуться до зёрнышка",
        "signature": "Будда"
      },
      /////////////////////////////////////////
      // Средневековье
      //////////////////////////////////////////

      {
        "epoch": "Общее Средневековье, 4в",
        "phrase": "Даже чудо от Бога",
        "signature": "Августин"
      },
      
      {
        "epoch": "Общее Средневековье, 4в",
        "phrase": "Превзойди самого себя",
        "signature": "Августин"
      },
      
      {
        "epoch": "Общее Средневековье, 4в",
        "phrase": "Бог ближе к человеку чем мир",
        "signature": "Августин"
      },
      
      {
        "epoch": "Общее Средневековье",
        "phrase": "Скорее верблюд пролезет в ушко иголки, чем богатый попадет в рай",
        "signature": "Библия"
      },
      
      {
        "epoch": "Патристика, 4в",
        "phrase": "Верую, чтобы понимать",
        "signature": "Августин"
      },
      
      {
        "epoch": "Патристика, 4в",
        "phrase": "Люди разные светильники",
        "signature": "Августин"
      },
      
      {
        "epoch": "Схоластика, 13в",
        "phrase": "Понятие точно отражает сущность",
        "signature": "Аквинский"
      },

      {
        "epoch": "Схоластика, 13в",
        "phrase": "Изучение понятий заменяет изучение вещей",
        "signature": "Аквинский"
      },
      
      {
        "epoch": "Схоластика, 13в",
        "phrase": "Бог создает и материю, и форму",
        "signature": "Аквинский"
      },
      
      /////////////////////////////////////////
      // Возрождение
      //////////////////////////////////////////
      {
        "epoch": "Общее Возрождение, 14в",
        "phrase": "Человек - это смертный Бог",
        "signature": "Петрарка"
      },
      
      {
        "epoch": "Предвозрождение, 13в",
        "phrase": "У человека двойное предназначение - божественное и земное",
        "signature": "Данте"
      },
        
      {
        "epoch": "Раннее Возрождение, 13в",
        "phrase": "Мир открытый, ограниченный и спасенный",
        "signature": "Данте"
      },
          
      {
        "epoch": "Раннее Возрождение, 14в",
        "phrase": "Философия – это поэзия образов",
        "signature": "Петрарка"
      },
        
      {
        "epoch": "Раннее Возрождение, 14в",
        "phrase": "Нам нужны художники, а не маляры",
        "signature": "Петрарка"
      },
        
      {
        "epoch": "Раннее Возрождение, 14в",
        "phrase": "Лучше желать, чем знать истину",
        "signature": "Петрарка"
      },
        
      {
        "epoch": "Раннее Возрождение, 14в",
        "phrase": "Лучше быть здоровым, чем красивым",
        "signature": "Петрарка"
      },
         
      {
        "epoch": "Раннее Возрождение, 14в",
        "phrase": "Сколько ты должен обществу, столько общество должно тебе",
        "signature": "Петрарка"
      },
        
      {
        "epoch": "Позднее возрождение, 15в",
        "phrase": "Человек – это проход для пищи",
        "signature": "Да Винчи"
      },
        
      {
        "epoch": "Позднее возрождение, 15в",
        "phrase": "Мир разворачивается из Бога, как линия из точки",
        "signature": "Кузанский"
      },
        
      {
        "epoch": "Позднее возрождение, 15в",
        "phrase": "В камне всё камень",
        "signature": "Кузанский"
      },
       
      {
        "epoch": "Позднее возрождение, 15в",
        "phrase": "Бог – это абсолютный максимум и абсолютный минимум",
        "signature": "Кузанский"
      },
        
      {
        "epoch": "Позднее возрождение, 15в",
        "phrase": "Бог – Неиное, всё во всём, ничто из всего",
        "signature": "Кузанский"
      },
        
      {
        "epoch": "Позднее возрождение, 15в",
        "phrase": "Бог – это бытие, возможность",
        "signature": "Кузанский"
      },
        
      {
        "epoch": "Позднее возрождение, 15в",
        "phrase": "В камне всё камень",
        "signature": "Кузанский"
      },
        
      {
        "epoch": "Позднее возрождение, 15в",
        "phrase": "Человек – и бог, и зверь, и ангел",
        "signature": "Кузанский"
      },
        
      {
        "epoch": "Позднее возрождение, 15в",
        "phrase": "Бог – лицо всех лиц",
        "signature": "Кузанский"
      },
        
      {
        "epoch": "Позднее возрождение, 15в",
        "phrase": "Бог везде и нигде",
        "signature": "Кузанский"
      }
    ]
var quotes_2 = [
{ 
"epoch": "Новое время, общее, 16в", 
"phrase": "По моему мнению в природе всё математично", 
"signature": "Декарт" 
}, 
{ 
"epoch": "Новое время, 16-17в", 
"phrase": "Ум подобен неровному зеркалу", 
"signature": "Бэкон" 
},
{ 
"epoch": "Новое время, 16-17в", 
"phrase": "К уму нужно привязывать гири", 
"signature": "Бэкон" 
},
{ 
"epoch": "Новое время, 16-17в", 
"phrase": "Больше ошибки в философии ведут к религии", 
"signature": "Бэкон" 
},
{ 
"epoch": "Новое время, 17в", 
"phrase": "Сомневаться нужно во всём кроме самого сомнения, сомнение это вид мышления", 
"signature": "Декарт" 
},
{ 
"epoch": "Новое время, 17в", 
"phrase": "Сомнение существует всегда, значит мышление существует всегда. Я мыслю значит я существую", 
"signature": "Декарт" 
},
{ 
"epoch": "Новое время, 17в", 
"phrase": "Не бывает частичного бытия и частичного знания", 
"signature": "Декарт" 
},
{ 
"epoch": "Новое время, 17в", 
"phrase": "Числа - это бестолочь", 
"signature": "Декарт" 
},
{ 
"epoch": "Новое время, Эмпиризм, 17-18 в", 
"phrase": "Физика бойся метафизики", 
"signature": "Исаак Ньютон" 
}, 
{ 
"epoch": "Новое время, Эмпиризм, 17-18 в", 
"phrase": "Нельзя умножать сущностей", 
"signature": "Исаак Ньютон" 
}, 
{ 
"epoch": "Новое время, Эмпиризм, 17-18 в", 
"phrase": "Пространство-вместилище тел и чувствище Бога", 
"signature": "Исаак Ньютон" 
}, 
{ 
"epoch": "18-19 в", 
"phrase": "Быть спинозистом-начало любой философии", 
"signature": "Гегель" 
}, 
{ 
"epoch": "19-20 в", 
"phrase": "Я взял в физику все положения Спинозы", 
"signature": "Энштейн" 
}, 
{ 
"epoch": "Новое время, Рационализм, 17в", 
"phrase": "Порядок идей и порядок вещей один и тот же", 
"signature": "Бенедикт Спиноза" 
}, 
{ 
"epoch": "Новое время, Рационализм, 17в", 
"phrase": "Ничего нового не происходит", 
"signature": "Бенедикт Спиноза" 
}, 
{ 
"epoch": "Новое время, Рационализм, 17в", 
"phrase": "В природе нет творения,есть только порождения", 
"signature": "Бенедикт Спиноза" 
}, 
{ 
"epoch": "Новое время, Рационализм, 17в", 
"phrase": "Свобода - это познанная необходимость", 
"signature": "Бенедикт Спиноза" 
}, 
{ 
"epoch": "Новое время, Рационализм, 17в", 
"phrase": "Мир выглядит как прямоугольник", 
"signature": "Бенедикт Спиноза" 
}, 
{ 
"epoch": "Новое время, Рационализм, 17-18в", 
"phrase": "Минимализм сущности требует максимум существования", 
"signature": "Лейбниц" 
}, 
{ 
"epoch": "Новое время, Рационализм, 17-18в", 
"phrase": "Сущность более менее реальна", 
"signature": "Лейбниц" 
}, 
{ 
"epoch": "Новое время, Рационализм, 17-18в", 
"phrase": "Равенство-крайния случай неравенства", 
"signature": "Лейбниц" 
}, 
{ 
"epoch": "Просвещение, 18в", 
"phrase": "Природа-лестница с незаметными ступенями", 
"signature": "Ламетри" 
}, 
{ 
"epoch": "Просвещение, 18в", 
"phrase": "Растение более менее животное, а животное-человек", 
"signature": "Дени Дидро" 
}, 
{ 
"epoch": "Просвещение, 17-18в", 
"phrase": "Церковь - цепь, опутывающая мир", 
"signature": "Вольтер" 
}, 
{ 
"epoch": "Просвещение, 18в", 
"phrase": "Священники-бездельники",
"signature": "Гольбах" 
}, 
{ 
"epoch": "Просвещение, 18в", 
"phrase": "Человек - самозаводящаяся машина", 
"signature": "Ламетри" 
}, 
{ 
"epoch": "Просвещение, 18в", 
"phrase": "Дурное пищеварение монарха может изменить ход истории",
"signature": "Гольбах" 
}, 
{ 
"epoch": "Просвещение, 17-18в", 
"phrase": "Идеи правят миром", 
"signature": "Вольтер" 
}, 
{ 
"epoch": "Просвещение, 18в", 
"phrase": "Хорошая книга тронет сердце государя",
"signature": "Гольбах" 
},
{ 
"epoch": "Просвещение, 18в", 
"phrase": "Ощущения - сотрясение мозга, а понятия - совокупность ощущений",
"signature": "Гельвеций" 
}, 
{ 
"epoch": "Просвещение, 17-18в", 
"phrase": "Свобода - наличие частной собственности", 
"signature": "Вольтер" 
}, 
{ 
"epoch": "Просвещение, 18в", 
"phrase": "Свобода - отсутствие частной собственности", 
"signature": "Руссо" 
}, 
{ 
"epoch": "Просвещение, 18в", 
"phrase": "Ни один элемент мира не участвует в ненужных комбинациях",
"signature": "Гольбах" 
},
{ 
"epoch": "Просвещение, 18в", 
"phrase": "Маленькие причины вызывают большие следствия",
"signature": "Гольбах" 
},
{ 
"epoch": "Просвещение, 18в", 
"phrase": "Материя-это то, что воздействует на наши органы чувств",
"signature": "Гольбах" 
},
{ 
"epoch": "Просвещение, 18в", 
"phrase": "Только собственник - истинный гражданин",
"signature": "Гольбах" 
},
{ 
"epoch": "Класс трактовка бытия, 20в", 
"phrase": "Движение - способ существования материи",
"signature": "Голанд" 
},
{ 
"epoch": "Класс трактовка бытия, 540 год до н.э.", 
"phrase": "Бытие есть, небытия нет",
"signature": "Парменид" 
},
{ 
"epoch": "Класс трактовка бытия, 19-20в", 
"phrase": "Существование выше бытия, а действительность выше существования",
"signature": "Ленин" 
},
{ 
"epoch": "Диалект трактовка бытия, 18-19в", 
"phrase": "Сущность - задняя часть бытия",
"signature": "Гегель" 
},
{ 
"epoch": "Диалект трактовка бытия, 18-19в", 
"phrase": "Сущность = основа + обоснованное",
"signature": "Гегель" 
},
{ 
"epoch": "Диалект трактовка бытия, 18-19в", 
"phrase": "Явление богаче сущности",
"signature": "Гегель" 
},
{ 
"epoch": "Диалект трактовка бытия, 18-19в", 
"phrase": "Форма-способ организации содержания",
"signature": "Гегель" 
},
{ 
"epoch": "???Атомизм", 
"phrase": "Форма-внешний образ атомов",
"signature": "Демокрит" 
},
{ 
"epoch": "Диалект трактовка бытия, 384 г до н.э.", 
"phrase": "Форма-духовная сущность",
"signature": "Аристотель" 
},
{ 
"epoch": "Диалект трактовка бытия, 1724-1804", 
"phrase": "Есть ограниченное целое и неограниченное целое",
"signature": "Кант" 
},
{ 
"epoch": "Диалект трактовка бытия, 19в", 
"phrase": "Развитость целого зависит от дифференциации частей",
"signature": "Фридрих Энгельс" 
},
{ 
"epoch": "Диалект трактовка бытия, 18-19в", 
"phrase": "Не бывает полного соответствия формы и содержания",
"signature": "Гегель" 
},
{ 
"epoch": "Диалект трактовка бытия, 19в", 
"phrase": "Система-единство МНОГООБРАЗИЯ, а целое-ЕДИНСТВО многообразия",
"signature": "Фридрих Энгельс" 
},
{ 
"epoch": "Причина и следствие, 18-19в", 
"phrase": "Причина-шествие субстанции",
"signature": "Гегель" 
},
{ 
"epoch": "Причина и следствие, 18-19в", 
"phrase": "Причина-сущность в действии",
"signature": "Гегель" 
},
{ 
"epoch": "Необход и случ, 18-19в", 
"phrase": "Необходимость и случайность противоположны",
"signature": "Гегель" 
},
{ 
"epoch": "Необход и случ, 341 г до н.э.", 
"phrase": "Случайность - незнание причины",
"signature": "Эпикур" 
},
{ 
"epoch": "Необход и случ, 18-19в", 
"phrase": "Необходимость-сущность в содержании",
"signature": "Гегель" 
},
{ 
"epoch": "Необход и случ, 18-19в", 
"phrase": "Случайность имеет и не имеет в себе основания",
"signature": "Гегель" 
},

{ 
"epoch": "Возмож и действ, 18-19в", 
"phrase": "Возможность - этап развития сущности",
"signature": "Гегель" 
},
{ 
"epoch": "Возмож и действ, 18-19в", 
"phrase": "Возможность - границы, в которых причина рождает несколько следствий",
"signature": "Гегель" 
},
{ 
"epoch": "Необход и случайность, 19в", 
"phrase": "Случайность-форма проявления необходимости и дополнения к ней",
"signature": "Фридрих Энгельс" 
},
{ 
"epoch": "Необход и случайность, 19-20в", 
"phrase": "Случайность-результат пересечения необходимых процессов ",
"signature": "Плеханов" 
},
{ 
"epoch": "Законы диалектики, 18-19в", 
"phrase": "Качество-совокупность свойств",
"signature": "Гегель" 
},
{ 
"epoch": "Законы диалектики, 18-19в", 
"phrase": "У объектов много свойств и одно качество",
"signature": "Гегель" 
},
{ 
"epoch": "Законы диалектики, 18-19в", 
"phrase": "Качество - тождественное с бытием определенность предмета",
"signature": "Гегель" 
},
{ 
"epoch": "Законы диалектики, 18-19в", 
"phrase": "Количество - качество в пространственно-временном аспекте",
"signature": "Гегель" 
},
{ 
"epoch": "Законы диалектики, 18-19в", 
"phrase": "Количество – внешняя определенность",
"signature": "Гегель" 
},
{ 
"epoch": "Законы диалектики, 18-19в", 
"phrase": "Бытие есть, а сущности нет",
"signature": "Гегель" 
},
{ 
"epoch": "Матер трактовка бытия, 19-20в", 
"phrase": "Материя-категория для обозначения объективной реальности, данной нам в ощущениях",
"signature": "Ленин" 
},
{ 
"epoch": "Некласс трактовка бытия, 19-20 в", 
"phrase": "Понятие теории относится к опыту, как гардеробный номер к пальто", 
"signature": "Энштейн" 
}, 
{ 
"epoch": "Некласс трактовка бытия, 19-20 в", 
"phrase": "Опасно оперировать наблюденными величинами", 
"signature": "Эйнштейн" 
}, 
{ 
"epoch": "Некласс трактовка бытия, 19-20 в", 
"phrase": "Наблюдение зависит от теоретического объяснения", 
"signature": "Энштейн" 
}, 
{ 
"epoch": "Некласс трактовка бытия, 19-20 в", 
"phrase": "Физика настолько проста, что математика должна быть сложной", 
"signature": "Энштейн" 
}, 
{ 
"epoch": "Некласс трактовка бытия, 19-20 в", 
"phrase": "Теория Бора недостаточно сумасшедшая, чтобы быть верной", 
"signature": "Энштейн" 
}, 
{ 
"epoch": "Некласс трактовка бытия, 19-20 в", 
"phrase": "Чем больше гоняешься за кварками,тем лучше они прячутся", 
"signature": "Энштейн" 
}, 
{ 
"epoch": "Некласс трактовка бытия, 20 в", 
"phrase": "Величина существует в момент измерения", 
"signature": "Гайзенберг" 
}, 
{ 
"epoch": "Класс трактовка познания, 18-19в", 
"phrase": "Знание бывает ограниченное и неограниченное и оно зависит от структуры мышления", 
"signature": "Кант" 
}, 
{ 
"epoch": "Класс трактовка познания, 18-19в", 
"phrase": "Видит не глаз, а мозг", 
"signature": "Кант" 
}, 
{ 
"epoch": "Класс трактовка познания, 18-19в", 
"phrase": "На трансцендентальные вопросы дают трансцендентальные ответы", 
"signature": "Кант" 
}, 
{ 
"epoch": "Класс трактовка познания, 18-19в", 
"phrase": "На трансцендентальные вопросы дают трансцендентальные ответы", 
"signature": "Кант" 
}, 
{ 
"epoch": "Герменевтика, 20в", 
"phrase": "Интерпретация - это игра", 
"signature": "Гадамер" 
}, 
{ 
"epoch": "Герменевтика,20в", 
"phrase": "Существовать - быть интерпретированным", 
"signature": "Гадамер" 
}, 
{ 
"epoch": "Герменевтика, 19 в", 
"phrase": "Нужно знать автора лучше, чем самого себя", 
"signature": "Шлейермахер" 
},
{ 
"epoch": "Класс трактовка человека, 18-19в", 
"phrase": "Поступай так как на твоем месте поступило бы человечество", 
"signature": "Кант" 
}, 
{ 
"epoch": "Класс трактовка человека, 18-19в", 
"phrase": "Поступай так, чтобы человек был целью, а не средством", 
"signature": "Кант" 
}, 
{ 
"epoch": "Класс трактовка человека, 18-19в", 
"phrase": "Добродеятель - внутренняя система насилия", 
"signature": "Кант" 
}, 
{ 
"epoch": "Класс трактовка человека,18-19в", 
"phrase": "Ты должен - значит ты можешь", 
"signature": "Кант" 
}, 
{ 
"epoch": "Класс трактовка человека, 18-19в", 
"phrase": "Воспитание ребенка начинается за сто лет до его рождения ", 
"signature": "Кант" 
}, 
{ 
"epoch": "Материализм, 19в", 
"phrase": "Сущность человека - совокупность общественных отношений", 
"signature": "Маркс" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "У человека карнавальное мышление", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Текст - это ухо", 
"signature": "Ницше" 
},
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Я не человек, я -динамит", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Учитесь танцевать", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Моя мысль-это мысль канатоходца ", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Падающего подтолкни", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Не можешь научиться летать - научись падать", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Бог умер", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Быть христианином-неприлично", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Бог-чересчур крайняя гипотеза", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Познание - опасное занятие", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Когда идешь к женщине - бери плеть", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Женщины все еще кошки, а в лучшем случае-коровы", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "У природы есть фундаментальный промах", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Человек-это и тварь,и творец", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Мы прошли путь от червяка к человеку, но многое осталось от червяка", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Остерегайся плевать против ветра", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Однажды среди океана нападет тоска по берегу", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Однажды ты поймешь, что нет ничего страшнее бесконечности", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Нужно носить в себе хаос, чтобы родить танцующую звезду", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Самым опасным врагом будешь ты сам", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "С истиной творится что-то неладное", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Боги рассмеялись,когда один объявил себя единственным", 
"signature": "Ницше" 
}, 
{ 
"epoch": "Некласс трактовка человека, 19в", 
"phrase": "Он мудрец,значит вернулся к состоянию ребенка", 
"signature": "Ницше" 
/////////////////// LUIZA /////////////////
},
{ 
"epoch": "Экзистенционализм, 19в", 
"phrase": "Чем больше я мыслю, тем меньше существую", 
"signature": "Кьеркегор" 
},
{ 
"epoch": "Экзистенционализм, 19в", 
"phrase": "Этот мир не имеет значения, кто это понял - тот свободный", 
"signature": "Камю" 
}, 
{ 
"epoch": "Экзистенционализм, 20в", 
"phrase": "Учиться жить - учиться умирать", 
"signature": "Ясперс" 
}, 
{ 
"epoch": "20в, немецкий экзистенциализм", 
"phrase": "Наука изучает человека частично", 
"signature": "Ясперс" 
}, 
{ 
"epoch": "20в, немецкий экзистенциализм", 
"phrase": "История-это не общая задача,а общая судьба", 
"signature": "Ясперс" 
}, 
{ 
"epoch": "20в, немецкий экзистенциализм", 
"phrase": "История развивается от высшего к низшему", 
"signature": "Ясперс" 
}, 
{ 
"epoch": "20в, немецкий экзистенциализм", 
"phrase": "Религиозные уставновки помогают экзистенции", 
"signature": "Ясперс" 
}, 
{ 
"epoch": "20в, немецкий экзистенциализм", 
"phrase": "Человек-пастух бытия,но не господин сущего", 
"signature": "Хайдеггер" 
}, 
{ 
"epoch": "20в, французкий экзистенциализм", 
"phrase": "Сущности у человека нет, есть только существования", 
"signature": "Сартр" 
},
{ 
"epoch": "20в, французкий экзистенциализм", 
"phrase": "Человек - дырка в бытии", 
"signature": "Сартр" 
},
{ 
"epoch": "20в,французкий экзистенциализм", 
"phrase": "Человек - проект самого себя", 
"signature": "Сартр" 
},
{ 
"epoch": "20в, французкий экзистенциализм", 
"phrase": "Основной вопрос философии - вопрос о самоубийстве", 
"signature": "Камю" 
},
{ 
"epoch": "20в,французкий экзистенциализм", 
"phrase": "Бунт - стратегическое, а революция - тактическое", 
"signature": "Камю" 
},
{ 
"epoch": "20в,французкий экзистенциализм", 
"phrase": "Бунт говорит бытию ДА", 
"signature": "Камю" 
},
{ 
"epoch": "Класс трактовка общества(матер), 19в", 
"phrase": "Общественная жизнь по существу является практической", 
"signature": "Маркс" 
},
{ 
"epoch": "Класс трактовка общества(матер), 19в", 
"phrase": "Общественное бытие определяет общественное сознание", 
"signature": "Маркс" 
},
{ 
"epoch": "Класс трактовка общества, ???", 
"phrase": "Общество - совокупность людей связанных гражданским долгом", 
"signature": "Аристотель" 
},
{ 
"epoch": "Класс трактовка общества(матер), 19в", 
"phrase": "Общественное бытие определяет общественное сознание", 
"signature": "Маркс" 
},
{ 
"epoch": "Класс трактовка общества(матер), 19в", 
"phrase": "Производственные отношения зависят от уровня развития производительных сил", 
"signature": "Маркс" 
},
{ 
"epoch": "19в", 
"phrase": "Абстрактной истины нет", 
"signature": "Гегель" 
},
{ 
"epoch": "19в, теория общественно-экономических формаций", 
"phrase": "Коммунизм есть гуманизм", 
"signature": "Маркс" 
},
{ 
"epoch": "19в, теория общественно-экономических формаций", 
"phrase": "Коммунизм есть процесс", 
"signature": "Маркс" 
},
{ 
"epoch": "19в, теория общественно-экономических формаций", 
"phrase": "История - это естественно-исторический процесс", 
"signature": "Маркс" 
},
{ 
"epoch": "18в,классическая трактовка об-ва", 
"phrase": "Общество-совокупность людей,связанных общественным договором", 
"signature": "Локк" 
},
{ 
"epoch": "19в, теория общественно-экономических формаций", 
"phrase": "Надстройка может ускорить или замедлить развитие базиса", 
"signature": "Энгельс" 
},
{ 
"epoch": "19в,социальная философия", 
"phrase": "Абстрактной истины нет", 
"signature": "Гегель" 
},
{ 
"epoch": "19в, теория общественно-экономических формаций", 
"phrase": "Революции - локомотивы истории", 
"signature": "Маркс" 
},
{ 
"epoch": "20в, неклассическая трактовка об-ва ", 
"phrase": "Конфликты исчезают при правильных ролях и функциях", 
"signature": "Парсонс" 
},
{ 
"epoch": "19в, цивилизационная трактовка об-ва и истории", 
"phrase": "Поле истории нужно исходить во всех направлениях", 
"signature": "Данилевский" 
},
{ 
"epoch": "20в, цивилизационная трактовка об-ва и истории ", 
"phrase": "Культура-тело души, а цивилизация - мумия", 
"signature": "Шпенглер" 
},
{ 
"epoch": "???", 
"phrase": "Я не знаю как можно быть персом", 
"signature": "Монтескье" 
},
{ 
"epoch": "Классическая марксистская трактовка сфер об-ва, 19-20в", 
"phrase": "История - история классовой борьбы", 
"signature": "Вебер" 
},
{ 
"epoch": "19в, классическая марксистская трактовка сфер об-ва", 
"phrase": "История - история классовой борьбы", 
"signature": "Маркс" 
},
{ 
"epoch": "1 в до н.э., духовная сфера об-ва", 
"phrase": "Культура - обработка почвы", 
"signature": "Катон" 
},
{ 
"epoch": "106 г до н.э., духовная сфера об-ва", 
"phrase": "Культура - воспитание души", 
"signature": "Цицерон" 
},
{ 
"epoch": "17 в, духовная сфера об-ва", 
"phrase": "Культура - переход от естественного природного состояния к созданию гос-ва", 
"signature": "Пуфендорф" 
},
{ 
"epoch": "19в, классическая марксистская трактовка сфер об-ва ", 
"phrase": "Идеи не имеют собственной истории", 
"signature": "Маркс" 
},
{ 
"epoch": "19в, классическая марксистская трактовка сфер об-ва ", 
"phrase": "Общественная жизнь является практической", 
"signature": "Маркс" 
},
{ 
"epoch": "19в, теория общественно-экономических формаций", 
"phrase": " Человек-главная производственная сила, а техника-решающая", 
"signature": "Энгельс" 
},
{ 
"epoch": "20в,понятие истины", 
"phrase": " ЛОЖЬ-низкая вероятность, истина-высокая", 
"signature": "Рейхенбах" 
},
{ 
"epoch": "20в,понятие истины", 
"phrase": " Истины в методологии нет", 
"signature": "Локатос" 
},
{ 
"epoch": "20в,понятие истины", 
"phrase": " Истина зависит от контекста", 
"signature": "Койрэ" 
},
{ 
"epoch": "20в,понятие истины", 
"phrase": " Каждая фундаментальная теория переписывает историю заново", 
"signature": "Койрэ" 
},
{ 
"epoch": "20-21 век,радикальный конструктивизм", 
"phrase": " Будь спонтанным", 
"signature": "Вацлавик" 
},
{ 
"epoch": "19-20 век,конструктивизм,постнеклассическая трактовка истины", 
"phrase": " Истина-хамелеон", 
"signature": "Херстер" 
},
{ 
"epoch": "19-20 век,конструктивизм,постнеклассическая трактовка истины", 
"phrase": " Знание-танец человека с миром", 
"signature": "Херстер" 
},
{ 
"epoch": "19-20 век,конструктивизм,постнеклассическая трактовка истины", 
"phrase": " Человек не может видеть одно и то же лицо дважды", 
"signature": "Херстер" 
},
{ 
"epoch": "20 век, постнеклассическая трактовка истины", 
"phrase": " Мы ударяем по клавишам возможного", 
"signature": "Хакен" 
},
{ 
"epoch": "19-20век, история науки", 
"phrase": " Развитие науки также бездонно, как и развитие природы", 
"signature": "Э. Мах" 
},
{ 
"epoch": "19-20век, история науки", 
"phrase": " Развитие науки также бездонно, как и развитие природы", 
"signature": "Э. Мах" 
},
{ 
"epoch": "19в,динамика науки", 
"phrase": "Если теория не согласуется с фактами,то это плохо для фактов", 
"signature": "Гегель" 
},
{ 
"epoch": "20в,динамика науки", 
"phrase": "Научная революция-смена парадигм", 
"signature": "Кун" 
},
{ 
"epoch": "20в,динамика науки", 
"phrase": "Происходит мистическая смена парадигм", 
"signature": "Локатос" 
},
{ 
"epoch": "19в,диалектическая логика",
"phrase": "Истина-есть процесс", 
"signature": "Гегель" 
}

]
jQuery('document').ready(function() {
	var previous_choise = 0;
	var current_array = quotes_1;
	var done = 0;
    function writeRandomQuote(quotes){
	    done = done + 1;
	    amount_q = quotes.length
	    number_quote = Math.floor(Math.random() * amount_q);
	    author_and_era = quotes[number_quote]["signature"] + ", " + quotes[number_quote]["epoch"]
	    jQuery('#quote').html(quotes[number_quote]["phrase"])
	    jQuery('#author_and_era').html(author_and_era)
	    jQuery('#done').html(done)
	    quotes.splice(number_quote, 1);
    }
    //writeRandomQuote(current_array);
    jQuery('#update').click(function() {
    	if(document.getElementById('1_sem').checked && previous_choise != 1) {
		  current_array = quotes_1
		  previous_choise = 1
		  jQuery('#amount').html("/"+current_array.length);
		  done = 0;
		}else if(document.getElementById('2_sem').checked && previous_choise != 2){
		  current_array = quotes_2
		  previous_choise = 2
		  jQuery('#amount').html("/"+current_array.length);
		  done = 0;
		}
		else if(document.getElementById('all').checked && previous_choise != 3){
		  current_array = quotes_1.concat(quotes_2)
		  previous_choise = 3
		  jQuery('#amount').html("/"+current_array.length);
		  done = 0;
		}
		writeRandomQuote(current_array);

});
    
    
})